renesas/rx-driver-package/source/r_tsip_rx_lib/r_tsip_rx_vx.xx/r_tsip_rx/src/targets/rx72m_rx72n_rx66n/r_tsip_rx_private.h
#define TSIP_PRV_USE_HMAC (TSIP_SHA_1_HMAC || TSIP_SHA_256_HMAC)

#define TSIP_PRV_USE_RSA_1024 (TSIP_RSAES_1024 || TSIP_RSASSA_1024)
#define TSIP_PRV_USE_RSA_2048 (TSIP_RSAES_2048 || TSIP_RSASSA_2048)
#define TSIP_PRV_USE_RSA_3072 (TSIP_RSAES_3072 || TSIP_RSASSA_3072)
#define TSIP_PRV_USE_RSA_4096 (TSIP_RSAES_4096 || TSIP_RSASSA_4096)

#define TSIP_PRV_USE_RSAES (TSIP_RSAES_1024 || TSIP_RSAES_2048 || TSIP_RSAES_3072 || TSIP_RSAES_4096)

#define TSIP_PRV_USE_RSASSA (TSIP_RSASSA_1024 || TSIP_RSASSA_2048 || TSIP_RSASSA_3072 || TSIP_RSASSA_4096)

#define TSIP_PRV_USE_ECDSA (TSIP_ECDSA_P192 | TSIP_ECDSA_P224 | TSIP_ECDSA_P256 | TSIP_ECDSA_P384)

#define TSIP_PRV_USE_ECC (TSIP_PRV_USE_ECDSA | TSIP_ECDH_P256)

/**********************************************************************************************************************
 Global Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 External global variables
 *********************************************************************************************************************/
extern uint32_t const S_FLASH[];

extern uint32_t S_RAM[R_TSIP_SRAM_WORD_SIZE];
extern uint32_t S_HEAP[R_TSIP_SHEAP_WORD_SIZE];
extern uint32_t S_INST[R_TSIP_SINST_WORD_SIZE];
extern uint32_t S_INST2[R_TSIP_SINST2_WORD_SIZE];

extern TSIP_GEN_MAC_CB_FUNC_T TSIP_GEN_MAC_CB_FUNC;

/**********************************************************************************************************************
 Exported global functions
 *********************************************************************************************************************/
/* --------------------- TSIP driver wrapper layer ---------------------- */

e_tsip_err_t R_TSIP_GenerateRandomNumberPrivate(uint32_t *random);

e_tsip_err_t R_TSIP_Aes128EcbEncryptInitPrivate(tsip_aes_key_index_t *key_index);
e_tsip_err_t R_TSIP_Aes128EcbEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128EcbEncryptFinalPrivate(uint32_t *OutData_Text, uint32_t *OutData_length);
e_tsip_err_t R_TSIP_Aes128EcbDecryptInitPrivate(tsip_aes_key_index_t *key_index);
e_tsip_err_t R_TSIP_Aes128EcbDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128EcbDecryptFinalPrivate(uint32_t *OutData_Text, uint32_t *OutData_length);
e_tsip_err_t R_TSIP_Aes128CbcEncryptInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes128CbcEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CbcEncryptFinalPrivate(uint32_t *OutData_Text, uint32_t *OutData_length);
e_tsip_err_t R_TSIP_Aes128CbcDecryptInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes128CbcDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CbcDecryptFinalPrivate(uint32_t *OutData_Text, uint32_t *OutData_length);

e_tsip_err_t R_TSIP_Aes256EcbEncryptInitPrivate(tsip_aes_key_index_t *key_index);
e_tsip_err_t R_TSIP_Aes256EcbEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256EcbEncryptFinalPrivate(uint32_t *OutData_Text, uint32_t *OutData_length);
e_tsip_err_t R_TSIP_Aes256EcbDecryptInitPrivate(tsip_aes_key_index_t *key_index);
e_tsip_err_t R_TSIP_Aes256EcbDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256EcbDecryptFinalPrivate(uint32_t *OutData_Text, uint32_t *OutData_length);
e_tsip_err_t R_TSIP_Aes256CbcEncryptInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes256CbcEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CbcEncryptFinalPrivate(uint32_t *OutData_Text, uint32_t *OutData_length);
e_tsip_err_t R_TSIP_Aes256CbcDecryptInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes256CbcDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CbcDecryptFinalPrivate(uint32_t *OutData_Text, uint32_t *OutData_length);

e_tsip_err_t R_TSIP_Aes128CtrInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes256CtrInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes128CtrUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CtrUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CtrFinalPrivate();
e_tsip_err_t R_TSIP_Aes256CtrFinalPrivate();

e_tsip_err_t R_TSIP_Aes128GcmEncryptInitPrivate(tsip_aes_key_index_t *key_index, e_tsip_tls13_phase_t tls13_phase,
        e_tsip_tls13_mode_t tls13_mode, tsip_tls13_handle_t *tls13_handle, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes128GcmEncryptUpdateAadPrivate(uint32_t *InData_DataA, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128GcmEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t MAX_CNT, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes128GcmEncryptFinalPrivate(uint32_t *InData_Text, uint32_t *InData_DataALen,
        uint32_t *InData_TextLen, uint32_t *OutData_Text, uint32_t *OutData_DataT);
e_tsip_err_t R_TSIP_Aes128GcmDecryptInitPrivate(tsip_aes_key_index_t *key_index, e_tsip_tls13_phase_t tls13_phase,
        e_tsip_tls13_mode_t tls13_mode, tsip_tls13_handle_t *tls13_handle, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes128GcmDecryptUpdateAadPrivate(uint32_t *InData_DataA, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128GcmDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t MAX_CNT, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes128GcmDecryptFinalPrivate(uint32_t *InData_Text, uint32_t *InData_DataT,
        uint32_t *InData_DataALen, uint32_t *InData_TextLen, uint32_t *InData_DataTLen, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes256GcmEncryptInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes256GcmEncryptUpdateAadPrivate(uint32_t *InData_DataA, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256GcmEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t MAX_CNT, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes256GcmEncryptFinalPrivate(uint32_t *InData_Text, uint32_t *InData_DataALen,
        uint32_t *InData_TextLen, uint32_t *OutData_Text, uint32_t *OutData_DataT);
e_tsip_err_t R_TSIP_Aes256GcmDecryptInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_Aes256GcmDecryptUpdateAadPrivate(uint32_t *InData_DataA, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256GcmDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t MAX_CNT, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes256GcmDecryptFinalPrivate(uint32_t *InData_Text, uint32_t *InData_DataT,
        uint32_t *InData_DataALen, uint32_t *InData_TextLen, uint32_t *InData_DataTLen, uint32_t *OutData_Text);
void         R_TSIP_Aes128GcmEncryptUpdateTransitionPrivate(void);
void         R_TSIP_Aes128GcmDecryptUpdateTransitionPrivate(void);
void         R_TSIP_Aes256GcmEncryptUpdateTransitionPrivate(void);
void         R_TSIP_Aes256GcmDecryptUpdateTransitionPrivate(void);

e_tsip_err_t R_TSIP_Aes128CcmEncryptInitPrivate(tsip_aes_key_index_t *key_index, e_tsip_tls13_phase_t tls13_phase,
        e_tsip_tls13_mode_t tls13_mode, tsip_tls13_handle_t *tls13_handle, uint32_t InData_TextLen,
        uint32_t *InData_IV, uint32_t *InData_Header, uint32_t Header_Len);
e_tsip_err_t R_TSIP_Aes128CcmEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CcmEncryptFinalPrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t *OutData_MAC);
e_tsip_err_t R_TSIP_Aes128CcmDecryptInitPrivate(tsip_aes_key_index_t *key_index, e_tsip_tls13_phase_t tls13_phase,
        e_tsip_tls13_mode_t tls13_mode, tsip_tls13_handle_t *tls13_handle, uint32_t InData_TextLen,
        uint32_t InData_MACLength, uint32_t *InData_IV, uint32_t *InData_Header, uint32_t Header_Len);
e_tsip_err_t R_TSIP_Aes128CcmDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CcmDecryptFinalPrivate(uint32_t *InData_Text, uint32_t *InData_MAC, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes256CcmEncryptInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV,
        uint32_t *InData_Header, uint32_t Header_Len);
e_tsip_err_t R_TSIP_Aes256CcmEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CcmEncryptFinalPrivate(uint32_t *InData_TextLen, uint32_t *InData_Text,
        uint32_t *OutData_Text, uint32_t *OutData_MAC);
e_tsip_err_t R_TSIP_Aes256CcmDecryptInitPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_IV,
        uint32_t *InData_Header, uint32_t Header_Len);
e_tsip_err_t R_TSIP_Aes256CcmDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CcmDecryptFinalPrivate(uint32_t *InData_Text, uint32_t *InData_TextLen, uint32_t *InData_MAC,
        uint32_t *InData_MACLength, uint32_t *OutData_Text);

e_tsip_err_t R_TSIP_Aes128CmacGenerateInitPrivate(tsip_aes_key_index_t *key_index);
e_tsip_err_t R_TSIP_Aes128CmacGenerateUpdatePrivate(uint32_t *InData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CmacGenerateFinalPrivate(uint32_t All_Msg_Len, uint32_t *InData_Text,
        uint32_t *OutData_DataT);
e_tsip_err_t R_TSIP_Aes128CmacVerifyInitPrivate(tsip_aes_key_index_t *key_index);
e_tsip_err_t R_TSIP_Aes128CmacVerifyUpdatePrivate(uint32_t *InData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CmacVerifyFinalPrivate(uint32_t All_Msg_Len, uint32_t *InData_Text, uint32_t *InData_DataT,
        uint32_t *InData_DataTLen);
e_tsip_err_t R_TSIP_Aes256CmacGenerateInitPrivate(tsip_aes_key_index_t *key_index);
e_tsip_err_t R_TSIP_Aes256CmacGenerateUpdatePrivate(uint32_t *InData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CmacGenerateFinalPrivate(uint32_t All_Msg_Len, uint32_t *InData_Text,
        uint32_t *OutData_DataT);
e_tsip_err_t R_TSIP_Aes256CmacVerifyInitPrivate(tsip_aes_key_index_t *key_index);
e_tsip_err_t R_TSIP_Aes256CmacVerifyUpdatePrivate(uint32_t *InData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CmacVerifyFinalPrivate(uint32_t All_Msg_Len, uint32_t *InData_Text, uint32_t *InData_DataT,
        uint32_t *InData_DataTLen);

e_tsip_err_t R_TSIP_Aes128KeyWrapPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_WrappedKeyType,
        uint32_t *InData_WrappedKeyIndex, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes256KeyWrapPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_WrappedKeyType,
        uint32_t *InData_WrappedKeyIndex, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes128KeyUnWrapPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_WrappedKeyType,
        uint32_t *InData_Text, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_Aes256KeyUnWrapPrivate(tsip_aes_key_index_t *key_index, uint32_t *InData_WrappedKeyType,
        uint32_t *InData_Text, uint32_t *OutData_KeyIndex);

e_tsip_err_t R_TSIP_Sha1InitPrivate(tsip_sha_md5_handle_t *handle);
e_tsip_err_t R_TSIP_Sha1UpdatePrivate(tsip_sha_md5_handle_t *handle, uint32_t *InData_PaddedMsg, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Sha1FinalPrivate(tsip_sha_md5_handle_t *handle, uint32_t MAX_CNT,
        uint32_t *OutData_MsgDigest, uint32_t *OutData_Length);
e_tsip_err_t R_TSIP_Sha256InitPrivate(tsip_sha_md5_handle_t *handle);
e_tsip_err_t R_TSIP_Sha256UpdatePrivate(tsip_sha_md5_handle_t *handle, uint32_t *InData_PaddedMsg, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Sha256FinalPrivate(tsip_sha_md5_handle_t *handle, uint32_t MAX_CNT,
        uint32_t *OutData_MsgDigest, uint32_t *OutData_Length);
e_tsip_err_t R_TSIP_Md5InitPrivate(tsip_sha_md5_handle_t *handle);
e_tsip_err_t R_TSIP_Md5UpdatePrivate(tsip_sha_md5_handle_t *handle, uint32_t *InData_PaddedMsg, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Md5FinalPrivate(tsip_sha_md5_handle_t *handle, uint32_t MAX_CNT,
        uint32_t *OutData_MsgDigest, uint32_t *OutData_Length);

