renesas/rx-driver-package/source/r_tsip_rx_lib/r_tsip_rx_vx.xx/r_tsip_rx/src/targets/rx72m_rx72n_rx66n/r_tsip_rx_private.h
e_tsip_err_t R_TSIP_GenerateTls13P256EccKeyIndexSub(uint32_t * InData_Cmd, uint32_t * InData_Handle,
        uint32_t * OutData_KeyIndex, uint32_t * OutData_PubKey);
e_tsip_err_t R_TSIP_Tls13GenerateEcdheSharedSecretSub(uint32_t * InData_Cmd, uint32_t * InData_PubKey,
        uint32_t * InData_KeyIndex, uint32_t * OutData_SharedSecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateHandshakeSecretSub(uint32_t * InData_SharedSecretKeyIndex,
        uint32_t * OutData_Handshake_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateServerHandshakeTrafficKeySub(uint32_t * InData_Cmd,
        uint32_t * InData_Handshake_SecretKeyIndex, uint32_t * InData_MsgHash,
        uint32_t * OutData_ServerWriteKeyIndex, uint32_t * OutData_ServerFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13ServerHandshakeVerificationSub(uint32_t * InData_Cmd,
        uint32_t * InData_ServerFinishedKeyIndex, uint32_t * InData_MsgHash, uint32_t * InData_ServerFinished,
        uint32_t * OutData_VerifyDataIndex);
e_tsip_err_t R_TSIP_Tls13GenerateClientHandshakeTrafficKeySub(uint32_t * InData_Cmd,
        uint32_t * InData_Handshake_SecretKeyIndex, uint32_t * InData_MsgHash, uint32_t * OutData_ClientWriteKeyIndex,
        uint32_t * OutData_ClientFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateMasterSecretSub(uint32_t * InData_Cmd, uint32_t * InData_Handshake_SecretKeyIndex,
        uint32_t * InData_VerifyDataIndex, uint32_t * OutData_Handle, uint32_t * OutData_Master_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateApplicationTrafficKeySub(uint32_t * InData_Cmd, uint32_t * InData_Handle,
        uint32_t * InData_Master_SecretKeyIndex, uint32_t * InData_MsgHash,
        uint32_t * OutData_ServerApplicationSecretKeyIndex, uint32_t * OutData_ClientApplicationSecretKeyIndex,
        uint32_t * OutData_ServerWriteKeyIndex, uint32_t * OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13UpdateApplicationTrafficKeySub(uint32_t * InData_Cmd, uint32_t * InData_UpdateKeyType,
        uint32_t * InData_Handle, uint32_t * InData_ApplicationSecretKeyIndex,
        uint32_t * OutData_ApplicationSecretKeyIndex, uint32_t * OutData_ApplicationWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateResumptionMasterSecretSub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_Master_SecretKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_RMaster_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GeneratePreSharedKeySub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_RMaster_SecretKeyIndex, uint32_t *InData_TicketNonceLen, uint32_t *InData_TicketNonce,
        uint32_t *OutData_PreSharedKeyIndex);
e_tsip_err_t R_TSIP_Tls13GeneratePskBinderKeySub(uint32_t *InData_Handle, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *OutData_BinderKeyIndex);
e_tsip_err_t R_TSIP_Tls13Generate0RttApplicationWriteKeySub(uint32_t *InData_Handle, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *InData_MsgHash, uint32_t *OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateResumptionHandshakeSecretSub(uint32_t *InData_Handle,
        uint32_t *InData_SharedSecretKeyIndexType, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *InData_SharedSecretKeyIndex, uint32_t *OutData_Handshake_SecretKeyIndex);
e_tsip_err_t R_TSIP_GenerateTls13SVP256EccKeyIndexSub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *OutData_KeyIndex, uint32_t *OutData_PubKey);
e_tsip_err_t R_TSIP_Tls13SVGenerateEcdheSharedSecretSub(uint32_t *InData_Cmd, uint32_t *InData_PubKey,
        uint32_t *InData_KeyIndex, uint32_t *OutData_SharedSecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateHandshakeSecretSub(uint32_t *InData_SharedSecretKeyIndex,
        uint32_t *OutData_Handshake_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateServerHandshakeTrafficKeySub(uint32_t *InData_Cmd,
        uint32_t *InData_Handshake_SecretKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_ServerWriteKeyIndex,
        uint32_t *OutData_ServerFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVClientHandshakeVerificationSub(uint32_t *InData_Cmd, uint32_t *InData_ClientFinishedKeyIndex,
        uint32_t *InData_MsgHash, uint32_t *InData_ClientFinished);
e_tsip_err_t R_TSIP_Tls13SVGenerateClientHandshakeTrafficKeySub(uint32_t *InData_Cmd,
        uint32_t *InData_Handshake_SecretKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_ClientWriteKeyIndex,
        uint32_t *OutData_ClientFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateMasterSecretSub(uint32_t *InData_Cmd, uint32_t *InData_Handshake_SecretKeyIndex,
        uint32_t *OutData_Handle, uint32_t *OutData_Master_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateApplicationTrafficKeySub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_Master_SecretKeyIndex, uint32_t *InData_MsgHash,
        uint32_t *OutData_ServerApplicationSecretKeyIndex, uint32_t *OutData_ClientApplicationSecretKeyIndex,
        uint32_t *OutData_ServerWriteKeyIndex, uint32_t *OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVUpdateApplicationTrafficKeySub(uint32_t *InData_Cmd, uint32_t *InData_UpdateKeyType,
        uint32_t *InData_Handle, uint32_t *InData_ApplicationSecretKeyIndex,
        uint32_t *OutData_ApplicationSecretKeyIndex, uint32_t *OutData_ApplicationWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateResumptionMasterSecretSub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_Master_SecretKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_RMaster_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGeneratePreSharedKeySub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_RMaster_SecretKeyIndex, uint32_t *InData_TicketNonceLen, uint32_t *InData_TicketNonce,
        uint32_t *OutData_PreSharedKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGeneratePskBinderKeySub(uint32_t *InData_Handle, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *OutData_BinderKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerate0RttApplicationWriteKeySub(uint32_t *InData_Handle,
        uint32_t *InData_PreSharedKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateResumptionHandshakeSecretSub(uint32_t *InData_Handle,
        uint32_t *InData_SharedSecretKeyIndexType, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *InData_SharedSecretKeyIndex, uint32_t *OutData_Handshake_SecretKeyIndex);

e_tsip_err_t R_TSIP_Rsa1024ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa1024ModularExponentDecryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048ModularExponentDecryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa3072ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text, 
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa4096ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text, 
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048DhKeyAgreementSub(uint32_t *InData_KeyIndex, uint32_t *InData_PrimNumIndex,
        uint32_t *InData_Message, uint32_t *InData_ModExp, uint32_t *OutData_ModExp);

e_tsip_err_t R_TSIP_EcdsaSigunatureGenerateSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *OutData_Signature);
e_tsip_err_t R_TSIP_EcdsaP384SigunatureGenerateSub(uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *OutData_Signature);
e_tsip_err_t R_TSIP_EcdsaSigunatureVerificationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *InData_Signature);
e_tsip_err_t R_TSIP_EcdsaP384SigunatureVerificationSub(uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *InData_Signature);

e_tsip_err_t R_TSIP_DlmsCosemQeuSignatureVerificationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_data, uint32_t *InData_Signature, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemQevSignatureGenerationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyType,
        uint32_t *InData_PubKeyIndex, uint32_t *InData_PrivKeyIndex, uint32_t *InData_key_id, uint32_t *OutData_data,
        uint32_t *OutData_Signature, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemCalculateZSub(uint32_t *InData_KeyType, uint32_t *InData_PubKeyIndex,
        uint32_t *InData_PrivKeyIndex, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemCalculateKekSub(uint32_t *InData_KeyIndexType, uint32_t *InData_KeyIndex,
        uint32_t *InData_KDFType, uint32_t *InData_PaddedMsg, uint32_t MAX_CNT, uint32_t *InData_SaltKeyIndex,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_EcdheP512KeyAgreementSub(uint32_t *InData_KeyIndex, uint32_t *InData_PubKey,
        uint32_t *OutData_PubKey);

void R_TSIP_TlsRootCertificateVerificationSubSub(void);
void R_TSIP_TlsGenerateSubSub(void);

void R_TSIP_SelfCheck1SubSub(void);
void R_TSIP_SelfCheck2SubSub(void);

void RX72M_RX72N_RX66N_func000(uint32_t *InData_PaddedMsg, int32_t MAX_CNT);
void RX72M_RX72N_RX66N_func001(void);
void RX72M_RX72N_RX66N_func002(void);
void RX72M_RX72N_RX66N_func003(uint32_t* ARG1);
void RX72M_RX72N_RX66N_func004(uint32_t ARG1);
void RX72M_RX72N_RX66N_func005(uint32_t ARG1);
void RX72M_RX72N_RX66N_func006(void);
void RX72M_RX72N_RX66N_func007(void);
void RX72M_RX72N_RX66N_func008(void);
void RX72M_RX72N_RX66N_func009(void);
void RX72M_RX72N_RX66N_func010(uint32_t ARG1);
void RX72M_RX72N_RX66N_func011(uint32_t *ARG1);
void RX72M_RX72N_RX66N_func015(void);
void RX72M_RX72N_RX66N_func022(void);
void RX72M_RX72N_RX66N_func023(void);
void RX72M_RX72N_RX66N_func025(uint32_t ARG1);
void RX72M_RX72N_RX66N_func027(uint32_t ARG1);
void RX72M_RX72N_RX66N_func028(uint32_t ARG1);
void RX72M_RX72N_RX66N_func030(void);
void RX72M_RX72N_RX66N_func031(uint32_t *ARG1);
void RX72M_RX72N_RX66N_func032(void);
void RX72M_RX72N_RX66N_func040(uint32_t ARG1);
void RX72M_RX72N_RX66N_func041(uint32_t ARG1);
void RX72M_RX72N_RX66N_func050(uint32_t ARG1);
void RX72M_RX72N_RX66N_func051(void);
void RX72M_RX72N_RX66N_func052(uint32_t ARG1);
void RX72M_RX72N_RX66N_func053(uint32_t ARG1);
void RX72M_RX72N_RX66N_func054(uint32_t ARG1, uint32_t ARG2);
void RX72M_RX72N_RX66N_func060(void);
void RX72M_RX72N_RX66N_func061(void);
void RX72M_RX72N_RX66N_func070(void);
void RX72M_RX72N_RX66N_func071(void);
void RX72M_RX72N_RX66N_func072(void);
void RX72M_RX72N_RX66N_func073(uint32_t *ARG1);
void RX72M_RX72N_RX66N_func074(void);
void RX72M_RX72N_RX66N_func075(void);
void RX72M_RX72N_RX66N_func080(void);
void RX72M_RX72N_RX66N_func100(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX72M_RX72N_RX66N_func101(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX72M_RX72N_RX66N_func102(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX72M_RX72N_RX66N_func103(void);
void RX72M_RX72N_RX66N_func200(void);
void RX72M_RX72N_RX66N_func202(void);
void RX72M_RX72N_RX66N_func205(void);
void RX72M_RX72N_RX66N_func206(void);
void RX72M_RX72N_RX66N_func207(void);
void RX72M_RX72N_RX66N_func304(void);
void RX72M_RX72N_RX66N_func307(void);
void RX72M_RX72N_RX66N_func308(void);
void RX72M_RX72N_RX66N_func309(void);
void RX72M_RX72N_RX66N_func310(void);
void RX72M_RX72N_RX66N_func311(void);
void RX72M_RX72N_RX66N_func312(uint32_t ARG1);
void RX72M_RX72N_RX66N_func313(uint32_t ARG1);
void RX72M_RX72N_RX66N_func314(uint32_t ARG1);
void RX72M_RX72N_RX66N_func315(uint32_t ARG1);
void RX72M_RX72N_RX66N_func316(void);
void RX72M_RX72N_RX66N_func317(void);
void RX72M_RX72N_RX66N_func318(void);
void RX72M_RX72N_RX66N_func319(uint32_t ARG1);
void RX72M_RX72N_RX66N_func320(uint32_t ARG1);
void RX72M_RX72N_RX66N_func321(uint32_t ARG1);
void RX72M_RX72N_RX66N_func322(uint32_t ARG1);
void RX72M_RX72N_RX66N_func323(void);
void RX72M_RX72N_RX66N_func324(void);
void RX72M_RX72N_RX66N_func325(void);
void RX72M_RX72N_RX66N_func401(void);
void RX72M_RX72N_RX66N_func402(void);

void firm_mac_read(uint32_t *InData_Program);

e_tsip_err_t rsassa_emsa_pss_encode(tsip_rsa_byte_data_t *message, uint8_t hash_type, uint32_t em_bits, uint8_t *em);

/**********************************************************************************************************************
 * Function Name: change_endian_long
 * Description  : change endian
 * Arguments    : data -
 *                    input data
 * Return Value : the data changing endian
 *********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(change_endian_long)
uint32_t change_endian_long(uint32_t data)
{
#if defined __LIT
    /* Casting is valid because it matches the type to the right side or argument. */
    return R_BSP_REVL(data);
#else
    return data;
#endif  /* defined __LIT */
}
/*********************************
 End of function change_endian_long
 **********************************/

#endif /* R_TSIP_RX_PRIVATE_HEADER_FILE */
